{
  "Can you tell me about a time where you worked well in a team?": "Spiderpig, Spiderpig. Does whatever a spiderpig does.",
  "What weaknesses do you have?": "Give me a ping, Vasily. One. Ping. Only.",
  "What are your goals?": "When he reached the New World, Cortez burned his ships. As a result, his men were well motivated.",
  "What's wrong with your face?": "Anatoli, you're afraid of our fleet. Well, you should be. Personally, I'd give us...one chance in three. More tea anyone?",
  "Where do you see yourself in 5 years' time?": "A little revolution now and then is a healthy thing, don't you think?",
  "Why did you leave your last job?": "Listen, I'm a politician which means I'm a cheat and a liar, and when I'm not kissing babies I'm stealing their lollipops. But it also means I keep my options open.",
  "What attracted you to this position?": "I know I've made some very poor decisions recently, but I can give you my complete assurance that my work will be back to normal. I've still got the greatest enthusiasm and confidence in the mission. And I want to help you.",
  "How do plan to continue your personal development within this organisation?": "I am afraid I can't do that Dave.",
  "How would you deal with a difficult team member?": "Just what do you think you're doing, Dave?",
  "What questions do you have for us?": "Dave, stop. Stop, will you? Stop, Dave. Will you stop, Dave? Stop, Dave. I'm afraid.",
  "Give an example of a time you overcame a communication difficulty": "Frankly, my dear, I don't give a damn.",
  "Give us a brief history of your background and experience.": "There's 106 miles to Chicago, we've got a full tank of gas, half a pack of cigarettes, it's dark out, and we're wearing sunglasses.",
  "Describe your current job role.": " I ran out of gas. I... I had a flat tire. I didn't have enough money for cab fare. My tux didn't come back from the cleaners. An old friend came in from out of town. Someone stole my car. There was an earthquake. A terrible flood. Locus. It wasn't my fault. I swear to god!",
  "What would you say your strengths are?": "No mam, we're musicians.",
  "What would you say is your greatest professional achievement?": "Toto, I've got a feeling we're not in Kansas anymore.",
  "What is your greatest personal achievement?": "Rosebud...",
  "What's your dream job?": "I'm as mad as hell, and I'm not going to take this anymore!",
  "What do you expect to get out of this job?": "You can't handle the truth!",
  "Give an example of a time you exercised leadership?": "You're gonna need a bigger boat.",
  "How would your boss and co-workers describe you?": "Carpe diem. Seize the day, boys. Make your lives extraordinary.",
  "How do you deal with pressure or stressful situations?": "Nobody puts Baby in a corner.",
  "What would your first 60 days look like in this role? How would you get started?": "There’s no place like home.",
  "What do you like to do outside of work?": "The first rule of Fight Club is you do not talk about Fight Club.",
  "How do you handle failure? Give an example.": "This is the beginning of a beautiful friendship.",
  "How would skills from your previous work be of use here?": "To infinity and beyond!",
  "Tell us about building difficult relationships and dealing with conflicting customer needs? ": "You had me at hello.",
  "What are the benefits of cultural diversity in the workplace?": "Leave the gun, take the cannoli.",
  "How do you deal with conflicting deadlines and demands?": "Roads? Where we're going we don't need roads.",
  "Tell us about a specific high stress situation?": "You don't understand! I could've had class. I could've been a contender. I could've been somebody.",
  "Have you ever had to deal with an awkward colleague at work?": "The greatest trick the devil ever pulled was convincing the world he didn't exist.",
  "Have you ever had a conflict with a manager?": "Just when I thought I was out, they pull me back in.",
  "How would you deal with unethical behaviour?": "Magic Mirror on the wall, who is the fairest one of all?",
  "Give us examples of self-development?": "I do not, for one, think that the problem was that the band was down.  I think that the problem may have been that there was a Stonehenge monument on the stage that was in danger of being crushed by a dwarf.",
  "Give us an example where you showed personal accountability?": "We're very lucky in the band in that we have two visionaries, David and Nigel, they're like poets, like Shelley and Byron. They're two distinct types of visionaries, it's like fire and ice, basically. I feel my role in the band is to be somewhere in the middle of that, kind of like lukewarm water.",
  "Tell us about a time you were persistent.": "I believe virtually everything I read, and I think that is what makes me more of a selective human than someone who doesn't believe anything.",
  "How would you confront a lack of support?": "Well, it’s one louder, isn’t it? It’s not ten. You see, most blokes, you know, will be playing at ten. You’re on ten here, all the way up, all the way up, all the way up, you’re on ten on your guitar. Where can you go from there? Where?",
  "Tell us about a time you were disappointed in your work?": "I feel the need, the need for speed.",
  "Have you ever thought about something for too short a time?": "...dogs and cats living together, mass hysteria!",
  "Have you ever thought about something for too long a time?": "If you’re going to build a time machine into a car, why not do it with some style?",
  "When have you created a concept to solve a problem?": "Now I have a machine gun. Ho-ho-ho.",
  "Tell us about a time when you spotted something early?": "Welcome to the party pal!",
  "Have you ever taken an unpopular stand?": "That's a nice suit. It'd be a shame to ruin it.",
  "Talk about changing jobs?": "I'm really starting to regret this movie quote schtick right about now.",
  "How do you deal with schedule upset?": "Dear God, what have I done?",
  "What about abrupt changes?": "We were somewhere around Barstow, on the edge of the desert, when the drugs began to take hold.",
  "How do you deal with boring tasks?": "The trick, William Potter, is not minding that it hurts.",
  "How do you deal with policies you don't agree with?": "By the pricking of my thumbs, \nSomething wicked this way comes.",
  "When have you shown initiative?": "O, full of scorpions is my mind!",
  "Describe a time you did more than required?": "O, then I see Queen Mab hath been with you... She is the fairies' midwife, and she comes in shape no bigger than an agate stone",
  "How do you monitor and improve your own performance?": "My Mama always said, 'Life was like a box of chocolates; you never know what you're gonna get.",
  "How do you structure your time and motivate yourself?": "I see dead people.",
  "Tell us about a time your innovation was not accepted by others?": "Get to the CHOPPA.",
  "Give an example of a time you anticipated obstacles?": "I eat Green Berets for breakfast. And right now, I’m very hungry!"
}